test-results/2025-12-21/microservices-scaled/soak-stress/summary.txt
     █ login-Pemohon

       ✓ signin status is 200
       ✓ signin success flag

       █ pemohon-flow

         ✓ create permohonan 201
         ✓ submit permohonan ok

     █ login-Admin

       ✓ signin status is 200
       ✓ signin success flag

       █ admin-flow

         ✓ list permohonan 200
         ✓ approve 200
         ✓ disposisi status 201

     █ login-Pimpinan

       ✓ signin status is 200
       ✓ signin success flag

       █ pimpinan-flow

         ✓ draft approve ok

     █ login-OPD

       ✓ signin status is 200
       ✓ signin success flag

       █ opd-flow

         ✓ kajian status ok

   ✓ auth_latency...................: avg=235.83ms min=53.73ms  p(50)=205.7ms  p(90)=392.27ms p(95)=455.38ms p(99)=573.98ms max=5.25s  
     checks.........................: 100.00% ✓ 136714    ✗ 0     
     data_received..................: 130 MB  36 kB/s
     data_sent......................: 70 MB   19 kB/s
     group_duration.................: avg=6.69s    min=6.94ms   p(50)=7.09s    p(90)=9.6s     p(95)=10.19s   p(99)=11.25s   max=16.68s 
     http_req_blocked...............: avg=4.94µs   min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=14.38ms
     http_req_connecting............: avg=732ns    min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=6.4ms  
   ✓ http_req_duration..............: avg=393.96ms min=503.9µs  p(50)=425.15ms p(90)=727.21ms p(95)=880.31ms p(99)=1.27s    max=5.25s  
       { expected_response:true }...: avg=393.96ms min=503.9µs  p(50)=425.15ms p(90)=727.21ms p(95)=880.31ms p(99)=1.27s    max=5.25s  
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 211195
     http_req_receiving.............: avg=71.38µs  min=0s       p(50)=0s       p(90)=140.46µs p(95)=517.59µs p(99)=1ms      max=18.5ms 
     http_req_sending...............: avg=13.66µs  min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=516.1µs  max=23.95ms
     http_req_tls_handshaking.......: avg=0s       min=0s       p(50)=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=0s     
     http_req_waiting...............: avg=393.87ms min=503.9µs  p(50)=425.08ms p(90)=727.13ms p(95)=880.01ms p(99)=1.27s    max=5.25s  
     http_reqs......................: 211195  58.511945/s
     iteration_duration.............: avg=7.81s    min=1.15s    p(50)=8.4s     p(90)=10.17s   p(95)=10.66s   p(99)=11.72s   max=16.68s 
     iterations.....................: 34589   9.582943/s
   ✓ permohonan_latency.............: avg=521.25ms min=21.28ms  p(50)=522.04ms p(90)=711.23ms p(95)=795.52ms p(99)=1.06s    max=3.83s  
   ✓ survey_latency.................: avg=660.56ms min=229.11ms p(50)=621.55ms p(90)=917.28ms p(95)=1.08s    p(99)=1.39s    max=4.09s  
     vus............................: 1       min=1       max=75  
     vus_max........................: 75      min=75      max=75  
   ✓ workflow_latency...............: avg=458.45ms min=503.9µs  p(50)=496.96ms p(90)=679.59ms p(95)=744.48ms p(99)=957.47ms max=3.69s